app/Controllers/Admin/DatapaketController.php

    public function index()
    {
        $model = new PaketUmrahModel();

        // Ambil keyword dari parameter GET
        $keyword = $this->request->getGet('keyword');

        if ($keyword) {
            // Cari di beberapa kolom
            $paket = $model
                ->like('nama_paket', $keyword)
                ->orLike('harga', $keyword)
                ->orLike('tanggal_berangkat', $keyword)
                ->orLike('durasi_hari', $keyword)
                ->orLike('fasilitas', $keyword)
                ->findAll();
        } else {
            $paket = $model->findAll();
---
SELECT *
FROM `paket_umrah`

    public function simpan()
    {
        $model = new PaketUmrahModel();
        $model->insert([
            'nama_paket' => $this->request->getPost('nama_paket'),
            'harga' => $this->request->getPost('harga'),
            'tanggal_berangkat' => $this->request->getPost('tanggal_berangkat'),
            'durasi_hari' => $this->request->getPost('durasi_hari'),
            'fasilitas' => $this->request->getPost('fasilitas'),
        ]);
---
INSERT INTO `paket_umrah` (`nama_paket`, `harga`, `tanggal_berangkat`, `durasi_hari`, `fasilitas`, `created_at`, `updated_at`) VALUES ('Paket Lebaran', '5000000', '2025-04-30', '15', 'mewahhhh', '2025-04-19 15:51:24', '2025-04-19 15:51:24')

    public function hapus($id)
    {
        $model = new PaketUmrahModel();
        $model->delete($id);
---
DELETE FROM `paket_umrah`
WHERE `id` IN ('2')