app/Controllers/Admin/JamaahController.php

SELECT *
FROM `jamaah`
---
    public function index()
    {
        $jamaahModel = new JamaahModel();
        $data['jamaah'] = $jamaahModel->findAll();

SELECT *
FROM `jamaah`
WHERE `jamaah`.`id` = '1'
DELETE FROM `jamaah`
WHERE `id` IN ('1')
---
    public function hapus($id)
    {
        $jamaahModel = new JamaahModel();
        $jamaah = $jamaahModel->find($id);

        if ($jamaah) {
            $jamaahModel->delete($id);