app/Controllers/Admin/PaketumrohController.php

SELECT *
FROM `paket_umrah`
---
    public function index()
    {
        $model = new PaketUmrahModel();
        $data['paket'] = $model->findAll();