app/Controllers/Admin/PembayaranController.php

    public function index()
    {
        $model = new PembayaranModel();
        $pendaftaranModel = new PendaftaranModel(); // Inisialisasi model Pendaftaran

        $data['pembayaran'] = $model
        ->select('pembayaran.*, jamaah.nama_lengkap, paket_umrah.nama_paket')
        ->join('pendaftaran', 'pendaftaran.id = pembayaran.pendaftaran_id')
        ->join('jamaah', 'jamaah.id = pendaftaran.jamaah_id')
        ->join('paket_umrah', 'paket_umrah.id = pendaftaran.paket_umrah_id')
        ->findAll();

        $data['pendaftaran'] = $pendaftaranModel
        ->select('pendaftaran.*, jamaah.nama_lengkap, paket_umrah.nama_paket')
        ->join('jamaah', 'jamaah.id = pendaftaran.jamaah_id')
        ->join('paket_umrah', 'paket_umrah.id = pendaftaran.paket_umrah_id')
        ->findAll();
---
SELECT `pembayaran`.*, `jamaah`.`nama_lengkap`, `paket_umrah`.`nama_paket`
FROM `pembayaran`
JOIN `pendaftaran` ON `pendaftaran`.`id` = `pembayaran`.`pendaftaran_id`
JOIN `jamaah` ON `jamaah`.`id` = `pendaftaran`.`jamaah_id`
JOIN `paket_umrah` ON `paket_umrah`.`id` = `pendaftaran`.`paket_umrah_id`
SELECT `pendaftaran`.*, `jamaah`.`nama_lengkap`, `paket_umrah`.`nama_paket`
FROM `pendaftaran`
JOIN `jamaah` ON `jamaah`.`id` = `pendaftaran`.`jamaah_id`
JOIN `paket_umrah` ON `paket_umrah`.`id` = `pendaftaran`.`paket_umrah_id`

        ];

        $model = new PembayaranModel();
        if (!$model->save($data)) {
---
INSERT INTO `pembayaran` (`pendaftaran_id`, `user_id`, `jumlah_pembayaran`, `metode_pembayaran`, `tanggal_pembayaran`, `bukti_pembayaran`, `created_at`, `updated_at`) VALUES ('1', 1, '5000000', 'Cash', '2025-04-23', '1745077937_2104be079c4560a6b283.png', '2025-04-19 15:52:17', '2025-04-19 15:52:17')