app/Controllers/Admin/PendaftaranController.php

SELECT `pendaftaran`.*, `jamaah`.`nama_lengkap`, `jamaah`.`no_hp`, `paket_umrah`.`nama_paket`, `users`.`nama_pengguna`
FROM `pendaftaran`
JOIN `jamaah` ON `jamaah`.`id` = `pendaftaran`.`jamaah_id`
JOIN `paket_umrah` ON `paket_umrah`.`id` = `pendaftaran`.`paket_umrah_id`
JOIN `users` ON `users`.`id` = `pendaftaran`.`user_id`
---
    public function index()
    {
        $data['pendaftaran'] = $this->pendaftaranModel
            ->select('pendaftaran.*, jamaah.nama_lengkap, jamaah.no_hp, paket_umrah.nama_paket, users.nama_pengguna')
            ->join('jamaah', 'jamaah.id = pendaftaran.jamaah_id')
            ->join('paket_umrah', 'paket_umrah.id = pendaftaran.paket_umrah_id')
            ->join('users', 'users.id = pendaftaran.user_id')
            ->findAll();

SELECT *
FROM `jamaah`
SELECT *
FROM `paket_umrah`
SELECT *
FROM `users`
---
    public function create()
    {
        $data = [
            'jamaah' => $this->jamaahModel->findAll(),
            'paket' => $this->paketUmrahModel->findAll(),
            'users' => $this->userModel->findAll()
        ];