app/Controllers/Admin/UserController.php

SELECT *
FROM `users`
WHERE `nama_pengguna` LIKE '%ran%' ESCAPE '!'
---
    public function index()
    {
        $userModel = new UserModel();

        // Ambil keyword pencarian (jika ada)
        $keyword = $this->request->getGet('q');

        // Jika keyword ada, lakukan pencarian
        if ($keyword) {
            $userModel->like('nama_pengguna', $keyword);
        }

        // Ambil data pengguna (baik hasil pencarian atau semua data)
        $users = $userModel->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function profile()
    {
        $session = session();
        $userId = $session->get('id'); // Pastikan session menyimpan ID user

        $userModel = new UserModel();
        $user = $userModel->find($userId);