app/Controllers/Admin/UserController.php

SELECT *
FROM `users`
---
    public function index()
    {
        $userModel = new UserModel();

        // Ambil data pengguna untuk ditampilkan
        $users = $userModel->findAll();

INSERT INTO `users` (`nama_pengguna`, `kata_sandi`, `peran`, `created_at`, `updated_at`) VALUES ('rangga', '12345', 'admin', '2025-04-13 16:37:09', '2025-04-13 16:37:09')
---
    public function simpan()
    {
        $userModel = new UserModel();

        $userModel->save([
            'nama_pengguna' => $this->request->getPost('nama_pengguna'),
            'kata_sandi' => $this->request->getPost('kata_sandi'),
            'peran' => $this->request->getPost('peran'),
        ]);

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
SELECT *
FROM `users`
---
    public function edit($id)
    {
        $userModel = new UserModel();
            $user = $userModel->find($id);

            // Kirim data pengguna yang akan diedit dan daftar semua pengguna
            return view('admin/user/index', [
                'users' => $userModel->findAll(), // Kirim semua pengguna untuk daftar
                'editData' => $user // Kirim data pengguna yang akan diedit
            ]);

DELETE FROM `users`
WHERE `id` IN ('2')
---
    public function hapus($id)
    {
        $model = new UserModel();
        $model->delete($id);