app/Controllers/User/DashboardController.php

    public function index(): string
    {
        $pendaftaranModel = new PendaftaranModel();
        $jamaahModel = new JamaahModel();
        $paketModel = new PaketUmrahModel();
        $pembayaranModel = new PembayaranModel();

        $data = [
            'totalPendaftaran' => $pendaftaranModel->countAll(),
            'totalJamaah'      => $jamaahModel->countAll(),
            'totalPaket'       => $paketModel->countAll(),
            'totalPembayaran'  => $pembayaranModel->countAll(),
        ];
---
SELECT COUNT(*) AS `numrows` FROM `pendaftaran`
SELECT COUNT(*) AS `numrows` FROM `jamaah`
SELECT COUNT(*) AS `numrows` FROM `paket_umrah`
SELECT COUNT(*) AS `numrows` FROM `pembayaran`