app/Controllers/LoginController.php

SELECT *
FROM `users`
WHERE `nama_pengguna` = 'rangga'
 LIMIT 1
---
    public function proses()
    {
        $userModel = new UserModel();

        $username = $this->request->getPost('nama_pengguna');
        $password = $this->request->getPost('kata_sandi');

        $user = $userModel->where('nama_pengguna', $username)->first();